import random
from twitter import Twitter, OAuth

access_token = ""
access_token_secret = ""
api_key = ""
api_secret = ""

t = Twitter(auth = OAuth(access_token, access_token_secret, api_key, api_secret))

x = random.randint(0, 7)
mylist = ["こないだロングスカート履いてて、駅の階段をのぼるときにスカートをつまんで少し持ち上げてたら、すれ違ったスーツの男性に「ケッ！ プリンセスか」と半笑いで吐き捨てられたので「いかにも」という気持ちでうやうやしく会釈してさしあげた。"
         ,"「最近出てきた DA PUMPっているじゃん、あれなんでセンターおじさんなの？」という、女子中学生らしき会話にドギュンズギュン胸うつ。"
         ,"恋人が深夜に眠れないと連絡を寄越してきたので「足が冷えてないか・歯を食いしばってないか」などのチェックリストと安眠環境音のURLを送って睡眠をサポートしたのですが、思い返せばあれは話したかったのかと別れて半年後に気がつきました。ついでにそのエピソードからつけられたあだ名はSiriです。"
         ,"着物でホケホケと町をうろついていたとき、見知らぬ着物警察に呼び止められて「どうしてきっちり着ないのに着物を着るの（意訳）」と聞かれたので「ちょっと着崩しとくと、こうやって着物に詳しい素敵なねえさんが構ってくれンですよ」って言ったら半日連れ回されていっぱい奢ってもらったことある"
         ,"私の出張中にゲゲゲの鬼太郎を観た娘が「パパが死んでも目玉になって、ずっと一緒にいたいな、だってパパが大好きだから……」と言っていたらしく感動していたら、私が帰宅する頃には「パパが死んで早く目玉のおやじになってほしい、パパが大好きだから……」に変化していた、という事がありました。"
         ,"両親は中学から付き合って結婚しとんやけど「16.17.18.19.20とか1番可愛い綺麗美しい時を全部俺にくれとんやけん、ヨボヨボしわしわになっても太っても見た目がどう変わろうが俺が責任持つというか最後まで愛する、まあそういう理由なしに一生愛するけどね」って父さんが今日言った惚れた"
         ,"満員電車の中で乗客のスマホが緊急地震速報で一斉に鳴ったんだけど、カップルの男の方がスマホを2台持っていたらしく慌てて止めていたものの、彼女らしき人に「は？なんでスマホ2台持ってんの？あたし知らないんだけど。どういうこと？」と問い詰められてて、マグニチュード8どころではなかった。"
         ,"てんとう虫を潰した子どもが「てんとうむしなんかいくらでもいる」と言うので、命を大切に思う気持ちと自分がされて嫌なことをしないでほしいことを伝えたかったんだけど、頭がまわらないんで「子どももいくらでもいるけど潰していい？」ってめちゃくちゃサイコパスなこと言ってしまった"
         ]

text = str(mylist[x])
statusUpdate = t.statuses.update(status=text)

# 生の投稿データの出力
print(statusUpdate)

# 要素を絞った投稿データの出力
print(statusUpdate['user']['screen_name'])
print(statusUpdate['user']['name'])
print(statusUpdate['user']['description'])
print(statusUpdate['text'])